$(function(){


    // ================================
    // fadeOut
    // fadeOut 버튼을 클릭하면
    // red 박스를 부드럽게 숨김
    // ================================

    $("#fadeOut").click(function(){

        $(".box1").fadeOut();

    });



    // ================================
    // fadeIn
    // fadeIn 버튼을 클릭하면
    // red 박스를 부드럽게 보여줌
    // ================================

    $("#fadeIn").click(function(){

        $(".box1").fadeIn();

    });



    // ================================
    // fadeToggle
    // green 박스를
    // 한번은 숨기고 한번은 보여줌
    // ================================

    $("#fadeToggle").click(function(){

        $(".box2").fadeToggle();

    });



    // ================================
    // slideUp
    // #ffcc00 박스를
    // 높이 0으로 접어서 숨김
    // ================================

    $("#slideUp").click(function(){

        $(".box3").slideUp();

    });



    // ================================
    // slideDown
    // #ffcc00 박스를
    // 다시 높이 200px로 펼침
    // ================================

    $("#slideDown").click(function(){

        $(".box3").slideDown();

    });



    // ================================
    // slideToggle
    // #c8ff00 박스를
    // 높이 0 / 200px 반복
    // ================================

    $("#slideToggle").click(function(){

        $(".box4").slideToggle();

    });



    // ================================
    // ani1
    // #12bfe7 박스를
    // 현재 위치에서 오른쪽으로 500px 이동
    // ================================

    $("#ani1").click(function(){

        $(".box5").animate({

            left: "500px"

        });

    });



    // ================================
    // ani2
    // #12bfe7 박스를
    // 원래 위치로 이동
    // ================================

    $("#ani2").click(function(){

        $(".box5").animate({

            left: "0px"

        });

    });


});